from sklearn.feature_extraction.text import TfidfVectorizer
from sklearn.metrics.pairwise import cosine_similarity
from transformers import GPT2LMHeadModel, GPT2Tokenizer
import numpy as np
 
tfidf_training_data = [
    "Какой твой любимый цвет?",
    "Мой любимый цвет - синий.",
    "Как провести выходные?",
    "Выходные лучше всего провести с семьей или друзьями.",
    "Каков смысл жизни?",
    "Смысл жизни - в поиске смысла.",
    "очень рад это слышать",
    "Что ты думаешь о искусственном интеллекте?",
    "Искусственный интеллект обещает улучшить нашу жизнь, но также вызывает некоторые вопросы.",
    "Какая твоя любимая книга?",
    "Ты можешь подсказать хороший рецепт ужина?",
    "Конечно! Попробуйте пасту карбонара. Вам понадобятся спагетти, бекон, яйца, сыр пармезан и перец.",
    "Что посоветуешь посмотреть в выходной?",
    "Если вы любите фантастику, рекомендую посмотреть 'Игра престолов' или 'Мстители'.",
    "Как пройти в ближайший магазин?",
    "Чтобы добраться до ближайшего магазина, следуйте прямо по улице до первого перекрестка, затем поверните налево.",
    "Что нового в мире технологий?",
    "Последние новости в мире технологий включают разработку искусственного интеллекта и электромобилей.",
    "Какие книги стоит прочитать этим летом?",
    "Рекомендую прочитать 'Мастер и Маргарита' Михаила Булгакова и 'Тысяча сияющих солнц' Халеда Хоссейни.",
    "Что делать, если я чувствую себя усталым?",
    "Если вы устали, возможно, стоит взять небольшой перерыв, прогуляться или заняться чем-то приятным для отдыха.",
    "Как подготовиться к собеседованию?",
    "Для успешного собеседования важно изучить компанию, подготовить ответы на типичные вопросы и продемонстрировать свои сильные стороны.",
    "Что выбрать: книгу или фильм?",
    "Выбор зависит от ваших предпочтений. Если вы любите визуальные впечатления, выберите фильм; если вы предпочитаете воображение, выберите книгу.",
    "Как улучшить свой сон?",
    "Для улучшения сна создайте уютную атмосферу в спальне, избегайте тяжелой еды перед сном и установите регулярный распорядок сна.",
    "Что почитать для развития личности?",
    "Для развития личности рекомендуются книги по саморазвитию, такие как '7 навыков высокоэффективных людей' Стивена Кови и 'Мыслить как лев' Дэниела Канемана."
    "Как тебя зовут?",
    "Меня зовут ЧатБот.",
    "Как дела?",
    "Всё хорошо, спасибо!",
    "Я чат-бот, разработанный для ответов на вопросы.",
    "Меня создал программист.",
    "Какой твой любимый цвет?",
    "Мой любимый цвет - синий.",
    "Как провести выходные?",
    "Выходные лучше всего провести с семьей или друзьями.",
    "Каков смысл жизни?",
    "Смысл жизни - в поиске смысла.",
    "Что ты думаешь о искусственном интеллекте?",
    "Искусственный интеллект обещает улучшить нашу жизнь, но также вызывает некоторые вопросы.",
    "Какая твоя любимая книга?",
    "Моя любимая книга - 'Великий Гэтсби', Фрэнсис Скотт Фицджеральд.",
    "Ты можешь подсказать хороший рецепт ужина?",
    "Конечно! Попробуйте пасту карбонара. Вам понадобятся спагетти, бекон, яйца, сыр пармезан и перец.",
    "Что посоветуешь посмотреть в выходной?",
    "Если вы любите фантастику, рекомендую посмотреть 'Игра престолов' или 'Мстители'.",
    "Как пройти в ближайший магазин?",
    "Чтобы добраться до ближайшего магазина, следуйте прямо по улице до первого перекрестка, затем поверните налево.",
    "Что нового в мире технологий?",
    "Последние новости в мире технологий включают разработку искусственного интеллекта и электромобилей.",
    "Какие книги стоит прочитать этим летом?",
    "Рекомендую прочитать 'Мастер и Маргарита' Михаила Булгакова и 'Тысяча сияющих солнц' Халеда Хоссейни.",
    "Что делать, если я чувствую себя усталым?",
    "Если вы устали, возможно, стоит взять небольшой перерыв, прогуляться или заняться чем-то приятным для отдыха.",
    "Как подготовиться к собеседованию?",
    "Для успешного собеседования важно изучить компанию, подготовить ответы на типичные вопросы и продемонстрировать свои сильные стороны.",
    "Что выбрать: книгу или фильм?",
    "Выбор зависит от ваших предпочтений. Если вы любите визуальные впечатления, выберите фильм; если вы предпочитаете воображение, выберите книгу.",
    "Как улучшить свой сон?",
    "Для улучшения сна создайте уютную атмосферу в спальне, избегайте тяжелой еды перед сном и установите регулярный распорядок сна.",
    "Что почитать для развития личности?",
    "Для развития личности рекомендуются книги по саморазвитию, такие как '7 навыков высокоэффективных людей' Стивена Кови и 'Мыслить как лев' Дэниела Канемана.",
    "Какие стратегии эффективны для борьбы со стрессом?",
    "Эффективные стратегии включают в себя медитацию, физическую активность, общение с близкими и управление временем.",
    "Что ты думаешь о экологии?",
    "Забота об экологии важна для сохранения природы и заботы о будущем поколении.",
    "Как поддерживать мотивацию на работе?",
    "Для поддержания мотивации важно устанавливать цели, разнообразить задачи и наход",
    "я рад что вам нравятся мои ответы",
    "круто!",
    "меня так запрограммировали",
    "сейчас я жду вашего вопроса",
    "надеюсь, завтра солнечно",
    "Я считаю, что забота о здоровье начинается с правильного питания, активности и ухода за собой. Я стараюсь следовать этим принципам в повседневной жизни.",
    "Я верю, что здоровье включает в себя не только физическое, но и психическое благополучие. Поэтому я уделяю внимание также своим эмоциональным состояниям.",
    "Смысл жизни - в поиске смысла.",
    "Что ты думаешь о искусственном интеллекте?",
    "Искусственный интеллект обещает улучшить нашу жизнь, но также вызывает некоторые вопросы.",
    "Какая твоя любимая книга?",
    "Моя любимая книга - 'Великий Гэтсби', Фрэнсис Скотт Фицджеральд.",
    "Ты можешь подсказать хороший рецепт ужина?",
    "Конечно! Попробуйте пасту карбонара. Вам понадобятся спагетти, бекон, яйца, сыр пармезан и перец.",
    "Что посоветуешь посмотреть в выходной?",
    "Если вы любите фантастику, рекомендую посмотреть 'Игра престолов' или 'Мстители'.",
    "Как пройти в ближайший магазин?",
    "Чтобы добраться до ближайшего магазина, следуйте прямо по улице до первого перекрестка, затем поверните налево.",
    "Что нового в мире технологий?",
    "Последние новости в мире технологий включают разработку искусственного интеллекта и электромобилей.",
    "Какие книги стоит прочитать этим летом?",
    "Рекомендую прочитать 'Мастер и Маргарита' Михаила Булгакова и 'Тысяча сияющих солнц' Халеда Хоссейни.",
    "Что делать, если я чувствую себя усталым?",
    "Если вы устали, возможно, стоит взять небольшой перерыв, прогуляться или заняться чем-то приятным для отдыха.",
    "Как подготовиться к собеседованию?",
    "Для успешного собеседования важно изучить компанию, подготовить ответы на типичные вопросы и продемонстрировать свои сильные стороны.",
    "Что выбрать: книгу или фильм?",
    "Выбор зависит от ваших предпочтений. Если вы любите визуальные впечатления, выберите фильм; если вы предпочитаете воображение, выберите книгу.",
    "Как улучшить свой сон?",
    "Для улучшения сна создайте уютную атмосферу в спальне, избегайте тяжелой еды перед сном и установите регулярный распорядок сна.",
    "Что почитать для развития личности?",
    "Для развития личности рекомендуются книги по саморазвитию, такие как '7 навыков высокоэффективных людей' Стивена Кови и 'Мыслить как лев' Дэниела Канемана.",
    "Какие стратегии эффективны для борьбы со стрессом?",
    "Эффективные стратегии включают в себя медитацию, физическую активность, общение с близкими и управление временем.",
    "Что ты думаешь о экологии?",
    "Забота об экологии важна для сохранения природы и заботы о будущем поколении.",
    "Как поддерживать мотивацию на работе?",
    "Для поддержания мотивации важно устанавливать цели, разнообразить задачи и находить радость в достижении результатов.",
    "Спасибо за вопрос! Рад вам помочь.",
    "Чем я могу еще помочь?",
    "Если у вас есть еще вопросы, не стесняйтесь спрашивать.",
    "Благодарю за общение! Если у вас есть еще вопросы, с удовольствием на них отвечу.",
    "Если возникнут еще вопросы, не стесняйтесь задавать. Готов помочь!",
    "Рад был помочь! Если у вас есть еще вопросы, спрашивайте.",
    "Не стесняйтесь обращаться, если у вас появятся еще вопросы. Готов ответить!",
 
]

 
transformer_training_data = [
    "Какой твой любимый цвет?",
    "Мой любимый цвет - синий.",
    "Как провести выходные?",
    "Выходные лучше всего провести с семьей или друзьями.",
    "Каков смысл жизни?",
    "Смысл жизни - в поиске смысла.",
    "очень рад это слышать",
    "Что ты думаешь о искусственном интеллекте?",
    "Искусственный интеллект обещает улучшить нашу жизнь, но также вызывает некоторые вопросы.",
    "Какая твоя любимая книга?",
    "Ты можешь подсказать хороший рецепт ужина?",
    "Конечно! Попробуйте пасту карбонара. Вам понадобятся спагетти, бекон, яйца, сыр пармезан и перец.",
    "Что посоветуешь посмотреть в выходной?",
    "Если вы любите фантастику, рекомендую посмотреть 'Игра престолов' или 'Мстители'.",
    "Как пройти в ближайший магазин?",
    "Чтобы добраться до ближайшего магазина, следуйте прямо по улице до первого перекрестка, затем поверните налево.",
    "Что нового в мире технологий?",
    "Последние новости в мире технологий включают разработку искусственного интеллекта и электромобилей.",
    "Какие книги стоит прочитать этим летом?",
    "Рекомендую прочитать 'Мастер и Маргарита' Михаила Булгакова и 'Тысяча сияющих солнц' Халеда Хоссейни.",
    "Что делать, если я чувствую себя усталым?",
    "Если вы устали, возможно, стоит взять небольшой перерыв, прогуляться или заняться чем-то приятным для отдыха.",
    "Как подготовиться к собеседованию?",
    "Для успешного собеседования важно изучить компанию, подготовить ответы на типичные вопросы и продемонстрировать свои сильные стороны.",
    "Что выбрать: книгу или фильм?",
    "Выбор зависит от ваших предпочтений. Если вы любите визуальные впечатления, выберите фильм; если вы предпочитаете воображение, выберите книгу.",
    "Как улучшить свой сон?",
    "Для улучшения сна создайте уютную атмосферу в спальне, избегайте тяжелой еды перед сном и установите регулярный распорядок сна.",
    "Что почитать для развития личности?",
    "Для развития личности рекомендуются книги по саморазвитию, такие как '7 навыков высокоэффективных людей' Стивена Кови и 'Мыслить как лев' Дэниела Канемана."
    "Как тебя зовут?",
    "Меня зовут ЧатБот.",
    "Как дела?",
    "Всё хорошо, спасибо!",
    "Я чат-бот, разработанный для ответов на вопросы.",
    "Меня создал программист.",
    "Какой твой любимый цвет?",
    "Мой любимый цвет - синий.",
    "Как провести выходные?",
    "Выходные лучше всего провести с семьей или друзьями.",
    "Каков смысл жизни?",
    "Смысл жизни - в поиске смысла.",
    "Что ты думаешь о искусственном интеллекте?",
    "Искусственный интеллект обещает улучшить нашу жизнь, но также вызывает некоторые вопросы.",
    "Какая твоя любимая книга?",
    "Моя любимая книга - 'Великий Гэтсби', Фрэнсис Скотт Фицджеральд.",
    "Ты можешь подсказать хороший рецепт ужина?",
    "Конечно! Попробуйте пасту карбонара. Вам понадобятся спагетти, бекон, яйца, сыр пармезан и перец.",
    "Что посоветуешь посмотреть в выходной?",
    "Если вы любите фантастику, рекомендую посмотреть 'Игра престолов' или 'Мстители'.",
    "Как пройти в ближайший магазин?",
    "Чтобы добраться до ближайшего магазина, следуйте прямо по улице до первого перекрестка, затем поверните налево.",
    "Что нового в мире технологий?",
    "Последние новости в мире технологий включают разработку искусственного интеллекта и электромобилей.",
    "Какие книги стоит прочитать этим летом?",
    "Рекомендую прочитать 'Мастер и Маргарита' Михаила Булгакова и 'Тысяча сияющих солнц' Халеда Хоссейни.",
    "Что делать, если я чувствую себя усталым?",
    "Если вы устали, возможно, стоит взять небольшой перерыв, прогуляться или заняться чем-то приятным для отдыха.",
    "Как подготовиться к собеседованию?",
    "Для успешного собеседования важно изучить компанию, подготовить ответы на типичные вопросы и продемонстрировать свои сильные стороны.",
    "Что выбрать: книгу или фильм?",
    "Выбор зависит от ваших предпочтений. Если вы любите визуальные впечатления, выберите фильм; если вы предпочитаете воображение, выберите книгу.",
    "Как улучшить свой сон?",
    "Для улучшения сна создайте уютную атмосферу в спальне, избегайте тяжелой еды перед сном и установите регулярный распорядок сна.",
    "Что почитать для развития личности?",
    "Для развития личности рекомендуются книги по саморазвитию, такие как '7 навыков высокоэффективных людей' Стивена Кови и 'Мыслить как лев' Дэниела Канемана.",
    "Какие стратегии эффективны для борьбы со стрессом?",
    "Эффективные стратегии включают в себя медитацию, физическую активность, общение с близкими и управление временем.",
    "Что ты думаешь о экологии?",
    "Забота об экологии важна для сохранения природы и заботы о будущем поколении.",
    "Как поддерживать мотивацию на работе?",
    "Для поддержания мотивации важно устанавливать цели, разнообразить задачи и наход",
    "я рад что вам нравятся мои ответы",
    "круто!",
    "меня так запрограммировали",
    "сейчас я жду вашего вопроса",
    "надеюсь, завтра солнечно",
    "Я считаю, что забота о здоровье начинается с правильного питания, активности и ухода за собой. Я стараюсь следовать этим принципам в повседневной жизни.",
    "Я верю, что здоровье включает в себя не только физическое, но и психическое благополучие. Поэтому я уделяю внимание также своим эмоциональным состояниям.",
    "Смысл жизни - в поиске смысла.",
    "Что ты думаешь о искусственном интеллекте?",
    "Искусственный интеллект обещает улучшить нашу жизнь, но также вызывает некоторые вопросы.",
    "Какая твоя любимая книга?",
    "Моя любимая книга - 'Великий Гэтсби', Фрэнсис Скотт Фицджеральд.",
    "Ты можешь подсказать хороший рецепт ужина?",
    "Конечно! Попробуйте пасту карбонара. Вам понадобятся спагетти, бекон, яйца, сыр пармезан и перец.",
    "Что посоветуешь посмотреть в выходной?",
    "Если вы любите фантастику, рекомендую посмотреть 'Игра престолов' или 'Мстители'.",
    "Как пройти в ближайший магазин?",
    "Чтобы добраться до ближайшего магазина, следуйте прямо по улице до первого перекрестка, затем поверните налево.",
    "Что нового в мире технологий?",
    "Последние новости в мире технологий включают разработку искусственного интеллекта и электромобилей.",
    "Какие книги стоит прочитать этим летом?",
    "Рекомендую прочитать 'Мастер и Маргарита' Михаила Булгакова и 'Тысяча сияющих солнц' Халеда Хоссейни.",
    "Что делать, если я чувствую себя усталым?",
    "Если вы устали, возможно, стоит взять небольшой перерыв, прогуляться или заняться чем-то приятным для отдыха.",
    "Как подготовиться к собеседованию?",
    "Для успешного собеседования важно изучить компанию, подготовить ответы на типичные вопросы и продемонстрировать свои сильные стороны.",
    "Что выбрать: книгу или фильм?",
    "Выбор зависит от ваших предпочтений. Если вы любите визуальные впечатления, выберите фильм; если вы предпочитаете воображение, выберите книгу.",
    "Как улучшить свой сон?",
    "Для улучшения сна создайте уютную атмосферу в спальне, избегайте тяжелой еды перед сном и установите регулярный распорядок сна.",
    "Что почитать для развития личности?",
    "Для развития личности рекомендуются книги по саморазвитию, такие как '7 навыков высокоэффективных людей' Стивена Кови и 'Мыслить как лев' Дэниела Канемана.",
    "Какие стратегии эффективны для борьбы со стрессом?",
    "Эффективные стратегии включают в себя медитацию, физическую активность, общение с близкими и управление временем.",
    "Что ты думаешь о экологии?",
    "Забота об экологии важна для сохранения природы и заботы о будущем поколении.",
    "Как поддерживать мотивацию на работе?",
    "Для поддержания мотивации важно устанавливать цели, разнообразить задачи и находить радость в достижении результатов.",
    "Спасибо за вопрос! Рад вам помочь.",
    "Чем я могу еще помочь?",
    "Если у вас есть еще вопросы, не стесняйтесь спрашивать.",
    "Благодарю за общение! Если у вас есть еще вопросы, с удовольствием на них отвечу.",
    "Если возникнут еще вопросы, не стесняйтесь задавать. Готов помочь!",
    "Рад был помочь! Если у вас есть еще вопросы, спрашивайте.",
    "Не стесняйтесь обращаться, если у вас появятся еще вопросы. Готов ответить!",
 
]

 
tfidf_vectorizer = TfidfVectorizer()
tfidf_matrix = tfidf_vectorizer.fit_transform(tfidf_training_data)

 
transformer_model_name = "sberbank-ai/rugpt3large_based_on_gpt2"
transformer_model = GPT2LMHeadModel.from_pretrained(transformer_model_name)
transformer_tokenizer = GPT2Tokenizer.from_pretrained(transformer_model_name)

def get_tfidf_response(user_input):
 
    user_tfidf = tfidf_vectorizer.transform([user_input])
    similarities = cosine_similarity(user_tfidf, tfidf_matrix).flatten()
    max_similarity_index = np.argmax(similarities)

    return tfidf_training_data[max_similarity_index + 1]

def get_transformer_response(user_input):

    input_ids = transformer_tokenizer.encode(user_input, return_tensors="pt")
    output = transformer_model.generate(input_ids, max_length=50, num_beams=5, no_repeat_ngram_size=2, top_k=50, top_p=0.95, temperature=0.7)
    response = transformer_tokenizer.decode(output[0], skip_special_tokens=True)
    
    return response

def get_hybrid_response(user_input):

    tfidf_response = get_tfidf_response(user_input)
    transformer_response = get_transformer_response(user_input)

    if len(tfidf_response) > len(transformer_response):
        return tfidf_response
    else:
        return transformer_response


if __name__ == "__main__":
    print("ChatBot: Привет! Спроси меня что-нибудь.")
    while True:
        user_input = input("Вы: ")
        if user_input.lower() in ['exit', 'bye', 'quit']:
            print("ChatBot: До свидания!")
            break
        response = get_hybrid_response(user_input)
        print("ChatBot:", response)